# Функція для додавання чисел
def додати(a, b)
  return a + b
end

# Функція для віднімання чисел
def відняти(a, b)
  return a - b
end

# Функція для множення чисел
def помножити(a, b)
  return a * b
end

# Функція для ділення чисел
def поділити(a, b)
  if b != 0
    return a / b
  else
    return "Помилка: неможливо поділити на нуль."
  end
end

# Запит користувача на операцію та числа
puts "Виберіть операцію: додавання (+), віднімання (-), множення (*), ділення (/)"
операція = gets.chomp

puts "Введіть перше число: "
число1 = gets.to_f

puts "Введіть друге число: "
число2 = gets.to_f

# Виконання обраної операції
результат = case операція
when '+'
  додати(число1, число2)
when '-'
  відняти(число1, число2)
when '*'
  помножити(число1, число2)
when '/'
  поділити(число1, число2)
else
  "Невірна операція"
end

# Виведення результату
puts "Результат: #{результат}"
